#pragma once

// ZeroCaliber (0.0.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass UE4_Mannequin_AnimBP.UE4_Mannequin_AnimBP_C
// 0x21A0 (0x2500 - 0x0360)
class UUE4_Mannequin_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_61B7FF504E25A63743CC3C8F93469A34;      // 0x0368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D09F6B8A4A79B32C2B6D3096DE4F0DA2;// 0x03B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_501057ED40788DE4A0F8F9B337BF4230;// 0x03F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93F503B44B3751124368FAAE4867362A;// 0x0440(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76690EEC40F9D7C7E0AC868EAB8561A9;// 0x0488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5798EA84C483E5F4848278745839BB2;// 0x04D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF78646B4723CCAFF9B4D4BEEE843547;// 0x0518(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_56826318426A0ECE146332AA43F5F6A2;// 0x0560(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E552C5A4489A83B0CD853AE35F11A3A;// 0x05A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_997A843745425B23DC26FB8B77B9D597;// 0x05F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BDBB312E46BD4F7CA40CB5B895A48B27;// 0x0638(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8CD2F71D45E64269B4F86BB66288351F;// 0x0680(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E8488C04F40B177FA5854AE10ADDF3F;// 0x06C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_571C0025429FE3F4859145A6BBAFDFB2;// 0x0710(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_715A2E544460AC2DA9F4CFA3A247F604;// 0x07C0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_369B26F64615D1DCBFE6A99C6CD4D296;// 0x0890(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A166F68945C7ABA376A5F9BC1AF5445E;// 0x0940(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EBE0ADD74C08AE127A7C81A3E62A82C6;// 0x0988(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4154917E41D8D973D474BBB6010FC7D5;// 0x0A38(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_372304314A39059DB85696A756ABF13B;// 0x0B08(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE1081EC4553252B6228F285FBBB3511;// 0x0BB8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F83B01C741091F166D5DEA948B24C1BF;// 0x0C00(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_35CF6D5040CC297A2DCF7ABBC9350C4A;// 0x0CD0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3F957FA14D8BAB1A59E467AC6989B200;// 0x0DF8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_09890EA545F38CB21781A4BF99DF847E;// 0x0F20(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6603589241F19E1A51778A857C1CC74F;// 0x0F68(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F3BA86254424D2A4E0F36D8BC6CDC4E4;// 0x1018(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C373DF4F4EDD9A8A80554A8C4C763E36;// 0x10E8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6FC76FCE4DDD99A21EF2EABB068CB3B0;// 0x1210(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C25EECB8459DB678D6F3CAB294753BCD;// 0x12E0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ABA09C8240BED6319B9FA295ECEA17F3;// 0x1408(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D536F094543DF7880AF30900A4A3230;// 0x1450(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9FACE06340973E87D4DB58A13D4F0174;// 0x1500(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4A44B49C4947799318DC95B169BB9FFF;// 0x1548(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9486F037471F19282C7827A22A4AA00C;// 0x15F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9BBFEE164236B93B8FB99AB58505DEFE;// 0x1640(0x00E0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_5EEE135B4DE0CA10F2559EB7335A79EC;// 0x1720(0x0200)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_33F9DEF641DFAB73A7691B87C126CA47;// 0x1920(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_7497600741545CBFA92533BCFFC41F67;// 0x19F0(0x0200)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7C84F15A429F6D84BF6AF6A6667A7616;// 0x1BF0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8FA4BAA34FB4ED419EB27191C7097215;// 0x1CD0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BC9CFEE54B4BE7E1BB84C8B6994D0E48;// 0x1D20(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ADF30DA14C7000184573E1BF82818CD1;// 0x1D70(0x00E0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_9C9CB84142D7DB2933F00B80BB5F1F59;// 0x1E50(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_368B670F4D672795B30C379E0119C696;// 0x1F20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F6ABF709480CD9C99ADBFBA1F0F94FA2;// 0x1FD0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9498525C48C651FB2A74A4BDEB59CC61;// 0x2080(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35AC5DA8452FEE58F20D4FA758BBEC4C;// 0x2130(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_428B52BA4C4CE8E5D3A391BFD8AC6712;// 0x21E0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A24E58864335339889E93DB508C94660;// 0x2290(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_128BF8404EBD56E73C9241AA1214D339;// 0x2340(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84CB1E68477283E6F7F6BDA08726A985;// 0x23F0(0x00B0)
	float                                              Speed;                                                    // 0x24A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Direction;                                                // 0x24A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EnableJump;                                               // 0x24A8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Jumping;                                                  // 0x24A9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Crouching;                                                // 0x24AA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x24AB(0x0001) MISSED OFFSET
	float                                              SpeedLimitAnimChange;                                     // 0x24AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AEnemyCharacterBase_C*                       EnemyCharacter;                                           // 0x24B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EnemyWeaponState>                      WeaponState;                                              // 0x24B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x24B9(0x0003) MISSED OFFSET
	float                                              AimYaw;                                                   // 0x24BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimPitch;                                                 // 0x24C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AttackAlphaBlend;                                         // 0x24C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           IdleStandAnimCurrent;                                     // 0x24C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UAnimSequenceBase*>                   IdleStandAnims;                                           // 0x24D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                              PlayRate;                                                 // 0x24E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StartPosition;                                            // 0x24E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BlackboardKeyEnemySenseState;                             // 0x24E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EnemySenseState>                       SenseState;                                               // 0x24F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x24F1(0x0003) MISSED OFFSET
	int                                                HitReactionRandomNumber;                                  // 0x24F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HitReaction;                                              // 0x24F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x24F9(0x0003) MISSED OFFSET
	float                                              Hit_Reaction_Value;                                       // 0x24FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass UE4_Mannequin_AnimBP.UE4_Mannequin_AnimBP_C");
		return ptr;
	}


	void HitReactionRandom();
	void Initilaize();
	void GetEnemyPawn(bool* Success);
	void Can_Jump(bool Should_Jump, bool* bJumping);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_BDBB312E46BD4F7CA40CB5B895A48B27();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_CF78646B4723CCAFF9B4D4BEEE843547();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_8CD2F71D45E64269B4F86BB66288351F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_4E8488C04F40B177FA5854AE10ADDF3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByBool_715A2E544460AC2DA9F4CFA3A247F604();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByBool_4154917E41D8D973D474BBB6010FC7D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_A5798EA84C483E5F4848278745839BB2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByBool_F83B01C741091F166D5DEA948B24C1BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendSpacePlayer_35CF6D5040CC297A2DCF7ABBC9350C4A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendSpacePlayer_3F957FA14D8BAB1A59E467AC6989B200();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_6603589241F19E1A51778A857C1CC74F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByBool_F3BA86254424D2A4E0F36D8BC6CDC4E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendSpacePlayer_C373DF4F4EDD9A8A80554A8C4C763E36();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByBool_6FC76FCE4DDD99A21EF2EABB068CB3B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendSpacePlayer_C25EECB8459DB678D6F3CAB294753BCD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_76690EEC40F9D7C7E0AC868EAB8561A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_93F503B44B3751124368FAAE4867362A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_5EEE135B4DE0CA10F2559EB7335A79EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByBool_33F9DEF641DFAB73A7691B87C126CA47();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_7497600741545CBFA92533BCFFC41F67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_LayeredBoneBlend_ADF30DA14C7000184573E1BF82818CD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_BlendListByInt_9C9CB84142D7DB2933F00B80BB5F1F59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_368B670F4D672795B30C379E0119C696();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_F6ABF709480CD9C99ADBFBA1F0F94FA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_9498525C48C651FB2A74A4BDEB59CC61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_35AC5DA8452FEE58F20D4FA758BBEC4C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_428B52BA4C4CE8E5D3A391BFD8AC6712();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_A24E58864335339889E93DB508C94660();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_128BF8404EBD56E73C9241AA1214D339();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_SequencePlayer_84CB1E68477283E6F7F6BDA08726A985();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_501057ED40788DE4A0F8F9B337BF4230();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_D09F6B8A4A79B32C2B6D3096DE4F0DA2();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void AnimNotify_Jump();
	void AnimNotify_IdleStart();
	void AnimNotify_JogStart();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_997A843745425B23DC26FB8B77B9D597();
	void AnimNotify_NotifyGetNewMagazine();
	void AnimNotify_NotifyMagazineIn();
	void AnimNotify_NotifyReleaseMagazine();
	void AnimNotify_NotifyStepCrouch();
	void AnimNotify_NotifyStepWalk();
	void AnimNotify_NotifyStepRun();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_2E552C5A4489A83B0CD853AE35F11A3A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4_Mannequin_AnimBP_AnimGraphNode_TransitionResult_56826318426A0ECE146332AA43F5F6A2();
	void HitReactionEvent(bool HitReaction);
	void ExecuteUbergraph_UE4_Mannequin_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
