#pragma once

// ZeroCaliber (0.6.0 EA) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class VRExpansionPlugin.GripMotionControllerComponent
// 0x01E0 (0x0800 - 0x0620)
class UGripMotionControllerComponent : public UMotionControllerComponent
{
public:
	bool                                               bOffsetByHMD;                                             // 0x0620(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0621(0x000F) MISSED OFFSET
	bool                                               bOffsetByControllerProfile;                               // 0x0630(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3F];                                      // 0x0631(0x003F) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnControllerProfileTransformChanged;                      // 0x0670(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnGripOutOfRange;                                         // 0x0680(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x78];                                      // 0x0690(0x0078) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnGrippedObject;                                          // 0x0708(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDroppedObject;                                          // 0x0718(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0728(0x0008) MISSED OFFSET
	TArray<struct FBPActorGripInformation>             GrippedObjects;                                           // 0x0730(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor)
	TArray<struct FBPActorGripInformation>             LocallyGrippedObjects;                                    // 0x0740(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor)
	bool                                               bAlwaysSendTickGrip;                                      // 0x0750(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0751(0x0007) MISSED OFFSET
	TArray<class UPrimitiveComponent*>                 AdditionalLateUpdateComponents;                           // 0x0758(0x0010) (BlueprintVisible, ExportObject, ZeroConstructor)
	struct FBPVRComponentPosRep                        ReplicatedControllerTransform;                            // 0x0768(0x001C) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      UnknownData05[0x1C];                                      // 0x0784(0x001C) MISSED OFFSET
	float                                              ControllerNetUpdateRate;                                  // 0x07A0(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x07A4(0x0004) MISSED OFFSET
	bool                                               bSmoothReplicatedMotion;                                  // 0x07A8(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bReplicateWithoutTracking;                                // 0x07A9(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x1F];                                      // 0x07AA(0x001F) MISSED OFFSET
	bool                                               bUseWithoutTracking;                                      // 0x07C9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x36];                                      // 0x07CA(0x0036) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GripMotionControllerComponent");
		return ptr;
	}


	void UpdatePhysicsHandleTransform_BP(const struct FBPActorGripInformation& GrippedActor, const struct FTransform& NewTransform);
	bool TeleportMoveGrippedComponent(class UPrimitiveComponent* ComponentToMove, bool bTeleportPhysicsGrips);
	bool TeleportMoveGrippedActor(class AActor* GrippedActorToMove, bool bTeleportPhysicsGrips);
	bool TeleportMoveGrip(bool bTeleportPhysicsGrips, bool bIsForPostTeleport, struct FBPActorGripInformation* Grip);
	bool SetUpPhysicsHandle_BP(const struct FBPActorGripInformation& newGrip);
	void SetSocketTransform(class UObject* ObjectToSocket, const struct FTransform_NetQuantize& RelativeTransformToParent);
	void SetPausedTransform(const struct FBPActorGripInformation& Grip, const struct FTransform& PausedTransform, bool bTeleport);
	void SetGripStiffnessAndDamping(const struct FBPActorGripInformation& Grip, float NewStiffness, float NewDamping, bool bAlsoSetAngularValues, float OptionalAngularStiffness, float OptionalAngularDamping, EBPVRResultSwitch* Result);
	void SetGripRelativeTransform(const struct FBPActorGripInformation& Grip, const struct FTransform& NewRelativeTransform, EBPVRResultSwitch* Result);
	void SetGripPaused(const struct FBPActorGripInformation& Grip, bool bIsPaused, bool bNoConstraintWhenPaused, EBPVRResultSwitch* Result);
	void SetGripLateUpdateSetting(const struct FBPActorGripInformation& Grip, EGripLateUpdateSettings NewGripLateUpdateSetting, EBPVRResultSwitch* Result);
	void SetGripCollisionType(const struct FBPActorGripInformation& Grip, EGripCollisionType NewGripCollisionType, EBPVRResultSwitch* Result);
	void SetGripAdditionTransform(const struct FBPActorGripInformation& Grip, const struct FTransform& NewAdditionTransform, bool bMakeGripRelative, EBPVRResultSwitch* Result);
	void Server_SendControllerTransform(const struct FBPVRComponentPosRep& NewTransform);
	void Server_NotifySecondaryAttachmentChanged_Retain(unsigned char GripID, const struct FBPSecondaryGripInfo& SecondaryGripInfo, const struct FTransform_NetQuantize& NewRelativeTransform);
	void Server_NotifySecondaryAttachmentChanged(unsigned char GripID, const struct FBPSecondaryGripInfo& SecondaryGripInfo);
	void Server_NotifyLocalGripRemoved(unsigned char GripID, const struct FVector_NetQuantize100& AngularVelocity, const struct FVector_NetQuantize100& LinearVelocity);
	void Server_NotifyLocalGripAddedOrChanged(const struct FBPActorGripInformation& newGrip);
	void Server_NotifyDropAndSocketGrip(unsigned char GripID, class USceneComponent* SocketingParent, const struct FName& OptionalSocketName, const struct FTransform_NetQuantize& RelativeTransformToParent);
	bool RemoveSecondaryAttachmentPoint(class UObject* GrippedObjectToRemoveAttachment, float LerpToTime);
	void PostTeleportMoveGrippedObjects();
	void OnRep_ReplicatedControllerTransform();
	void OnRep_LocallyGrippedObjects();
	void OnRep_GrippedObjects();
	void NotifyDropAndSocket(const struct FBPActorGripInformation& NewDrop);
	void NotifyDrop(const struct FBPActorGripInformation& NewDrop, bool bSimulate);
	void NewControllerProfileLoaded();
	bool HasGrippedObjects();
	bool GripObjectByInterface(class UObject* ObjectToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const struct FName& OptionalBoneToGripName, bool bIsSlotGrip);
	bool GripObject(class UObject* ObjectToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const struct FName& OptionalSnapToSocketName, const struct FName& OptionalBoneToGripName, EGripCollisionType GripCollisionType, EGripLateUpdateSettings GripLateUpdateSetting, EGripMovementReplicationSettings GripMovementReplicationSetting, float GripStiffness, float GripDamping, bool bIsSlotGrip);
	bool GripControllerIsTracked();
	bool GripComponent(class UPrimitiveComponent* ComponentToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const struct FName& OptionalBoneToGrip_Name, const struct FName& OptionalBoneToGripName, EGripCollisionType GripCollisionType, EGripLateUpdateSettings GripLateUpdateSetting, EGripMovementReplicationSettings GripMovementReplicationSetting, float GripStiffness, float GripDamping, bool bIsSlotGrip);
	bool GripActor(class AActor* ActorToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const struct FName& OptionalSnapToSocketName, const struct FName& OptionalBoneToGripName, EGripCollisionType GripCollisionType, EGripLateUpdateSettings GripLateUpdateSetting, EGripMovementReplicationSettings GripMovementReplicationSetting, float GripStiffness, float GripDamping, bool bIsSlotGrip);
	void GetPhysicsVelocities(const struct FBPActorGripInformation& Grip, struct FVector* AngularVelocity, struct FVector* LinearVelocity);
	bool GetIsSecondaryAttachment(class USceneComponent* ComponentToCheck, struct FBPActorGripInformation* Grip);
	bool GetIsObjectHeld(class UObject* ObjectToCheck);
	bool GetIsHeld(class AActor* ActorToCheck);
	bool GetIsComponentHeld(class UPrimitiveComponent* ComponentToCheck);
	void GetHandType(EControllerHand* Hand);
	void GetGrippedObjects(TArray<class UObject*>* GrippedObjectsArray);
	void GetGrippedComponents(TArray<class UPrimitiveComponent*>* GrippedComponentsArray);
	void GetGrippedActors(TArray<class AActor*>* GrippedActorArray);
	bool GetGripDistance_BP(const struct FVector& ExpectedLocation, struct FBPActorGripInformation* Grip, float* CurrentDistance);
	void GetGripByObject(class UObject* ObjectToLookForGrip, struct FBPActorGripInformation* Grip, EBPVRResultSwitch* Result);
	void GetGripByID(unsigned char IDToLookForGrip, struct FBPActorGripInformation* Grip, EBPVRResultSwitch* Result);
	void GetGripByComponent(class UPrimitiveComponent* ComponentToLookForGrip, struct FBPActorGripInformation* Grip, EBPVRResultSwitch* Result);
	void GetGripByActor(class AActor* ActorToLookForGrip, struct FBPActorGripInformation* Grip, EBPVRResultSwitch* Result);
	void GetControllerDeviceID(bool bCheckOpenVROnly, struct FXRDeviceId* DeviceID, EBPVRResultSwitch* Result);
	void GetAllGrips(TArray<struct FBPActorGripInformation>* GripArray);
	bool DropObjectByInterface(class UObject* ObjectToDrop, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
	bool DropObject(class UObject* ObjectToDrop, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
	bool DropGrip(const struct FBPActorGripInformation& Grip, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
	bool DropComponent(class UPrimitiveComponent* ComponentToDrop, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
	bool DropAndSocketObject(class UObject* ObjectToDrop, class USceneComponent* SocketingParent, const struct FName& OptionalSocketName, const struct FTransform_NetQuantize& RelativeTransformToParent);
	bool DropAndSocketGrip(const struct FBPActorGripInformation& GripToDrop, class USceneComponent* SocketingParent, const struct FName& OptionalSocketName, const struct FTransform_NetQuantize& RelativeTransformToParent);
	bool DropActor(class AActor* ActorToDrop, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
	bool DestroyPhysicsHandle_BP(const struct FBPActorGripInformation& Grip);
	struct FTransform CreateGripRelativeAdditionTransform_BP(const struct FBPActorGripInformation& GripToSample, const struct FTransform& AdditionTransform, bool bGripRelative);
	struct FTransform STATIC_ConvertToGripRelativeTransform(const struct FTransform& GrippedActorTransform, const struct FTransform& InTransform);
	struct FTransform ConvertToControllerRelativeTransform(const struct FTransform& InTransform);
	void Client_NotifyInvalidLocalGrip(class UObject* LocallyGrippedObject);
	bool BP_HasGripMovementAuthority(const struct FBPActorGripInformation& Grip);
	bool BP_HasGripAuthority(const struct FBPActorGripInformation& Grip);
	bool AddSecondaryAttachmentPoint(class UObject* GrippedObjectToAddAttachment, class USceneComponent* SecondaryPointComponent, const struct FTransform& OriginalTransform, bool bTransformIsAlreadyRelative, float LerpToTime, bool bIsSlotGrip);
};


// Class VRExpansionPlugin.GrippableActor
// 0x00D0 (0x03F8 - 0x0328)
class AGrippableActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0328(0x0010) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0338(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bAllowIgnoringAttachOnOwner;                              // 0x0358(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x0359(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x035A(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x0360(0x0098) (Edit, BlueprintVisible, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableActor");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.GrippableBoxComponent
// 0x00D0 (0x0660 - 0x0590)
class UGrippableBoxComponent : public UBoxComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0590(0x0010) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x05A0(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x05C0(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bReplicateMovement;                                       // 0x05C1(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x05C2(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x05C8(0x0098) (Edit, BlueprintVisible, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableBoxComponent");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.GrippableCapsuleComponent
// 0x00D0 (0x0660 - 0x0590)
class UGrippableCapsuleComponent : public UCapsuleComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0590(0x0010) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x05A0(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x05C0(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bReplicateMovement;                                       // 0x05C1(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x05C2(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x05C8(0x0098) (Edit, BlueprintVisible, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableCapsuleComponent");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.OptionalRepSkeletalMeshComponent
// 0x0000 (0x0BA0 - 0x0BA0)
class UOptionalRepSkeletalMeshComponent : public USkeletalMeshComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.OptionalRepSkeletalMeshComponent");
		return ptr;
	}

};


// Class VRExpansionPlugin.GrippableSkeletalMeshActor
// 0x00D0 (0x0480 - 0x03B0)
class AGrippableSkeletalMeshActor : public ASkeletalMeshActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x03B0(0x0010) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x03C0(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bAllowIgnoringAttachOnOwner;                              // 0x03E0(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x03E1(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x03E2(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x03E8(0x0098) (Edit, BlueprintVisible, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableSkeletalMeshActor");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.GrippableSkeletalMeshComponent
// 0x00D0 (0x0C70 - 0x0BA0)
class UGrippableSkeletalMeshComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0BA0(0x0008) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0BA8(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x0BC8(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bReplicateMovement;                                       // 0x0BC9(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0BCA(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x0BD0(0x0098) (Edit, BlueprintVisible, Net)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0C68(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableSkeletalMeshComponent");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.GrippableSphereComponent
// 0x00D0 (0x0660 - 0x0590)
class UGrippableSphereComponent : public USphereComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0590(0x0008) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0598(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x05B8(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bReplicateMovement;                                       // 0x05B9(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x05BA(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x05C0(0x0098) (Edit, BlueprintVisible, Net)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0658(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableSphereComponent");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.OptionalRepStaticMeshComponent
// 0x0010 (0x0600 - 0x05F0)
class UOptionalRepStaticMeshComponent : public UStaticMeshComponent
{
public:
	bool                                               bReplicateMovement;                                       // 0x05F0(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x05F1(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.OptionalRepStaticMeshComponent");
		return ptr;
	}

};


// Class VRExpansionPlugin.GrippableStaticMeshActor
// 0x00D0 (0x0408 - 0x0338)
class AGrippableStaticMeshActor : public AStaticMeshActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0338(0x0010) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0348(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bAllowIgnoringAttachOnOwner;                              // 0x0368(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x0369(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x036A(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x0370(0x0098) (Edit, BlueprintVisible, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableStaticMeshActor");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.GrippableStaticMeshComponent
// 0x00D0 (0x06C0 - 0x05F0)
class UGrippableStaticMeshComponent : public UStaticMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x05F0(0x0010) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0600(0x0020) (Edit, BlueprintVisible, Net)
	bool                                               bRepGripSettingsAndGameplayTags;                          // 0x0620(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bReplicateMovement;                                       // 0x0621(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0622(0x0006) MISSED OFFSET
	struct FBPInterfaceProperties                      VRGripInterfaceSettings;                                  // 0x0628(0x0098) (Edit, BlueprintVisible, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.GrippableStaticMeshComponent");
		return ptr;
	}


	void TickGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation, float DeltaTime);
	EGripInterfaceTeleportBehavior TeleportBehavior();
	bool SimulateOnDrop();
	void SetHeld(class UGripMotionControllerComponent* HoldingController, bool bIsHeld);
	ESecondaryGripType SecondaryGripType();
	bool RequestsSocketing(class USceneComponent** ParentToSocketTo, struct FName* OptionalSocketName, struct FTransform_NetQuantize* RelativeTransform);
	void OnUsed();
	void OnSecondaryUsed();
	void OnSecondaryGripRelease(class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnSecondaryGrip(class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
	void OnInput(const struct FKey& Key, TEnumAsByte<EInputEvent> KeyEvent);
	void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void OnEndUsed();
	void OnEndSecondaryUsed();
	void OnChildGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
	void OnChildGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
	void IsHeld(class UGripMotionControllerComponent** HoldingController, bool* bIsHeld);
	EGripMovementReplicationSettings GripMovementReplicationType();
	EGripLateUpdateSettings GripLateUpdateSetting();
	float GripBreakDistance();
	EGripCollisionType GetPrimaryGripType(bool bIsSlot);
	void GetGripStiffnessAndDamping(float* GripStiffnessOut, float* GripDampingOut);
	bool DenyGripping();
	void ClosestGripSlotInRange(const struct FVector& WorldLocation, bool bSecondarySlot, class UGripMotionControllerComponent* CallingController, const struct FName& OverridePrefix, bool* bHadSlotInRange, struct FTransform* SlotWorldTransform);
	struct FBPAdvGripSettings AdvancedGripSettings();
};


// Class VRExpansionPlugin.ParentRelativeAttachmentComponent
// 0x0040 (0x0280 - 0x0240)
class UParentRelativeAttachmentComponent : public USceneComponent
{
public:
	float                                              YawTolerance;                                             // 0x0240(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LerpSpeed;                                                // 0x0244(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bLerpTransition;                                          // 0x0248(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0249(0x0010) MISSED OFFSET
	bool                                               bUseFeetLocation;                                         // 0x0259(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bOffsetByHMD;                                             // 0x025A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreRotationFromParent;                                // 0x025B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x025C(0x0004) MISSED OFFSET
	struct FBPVRWaistTracking_Info                     OptionalWaistTrackingParent;                              // 0x0260(0x0020) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.ParentRelativeAttachmentComponent");
		return ptr;
	}

};


// Class VRExpansionPlugin.ReplicatedVRCameraComponent
// 0x0060 (0x0840 - 0x07E0)
class UReplicatedVRCameraComponent : public UCameraComponent
{
public:
	unsigned char                                      UnknownData00[0x2];                                       // 0x07E0(0x0002) MISSED OFFSET
	bool                                               bSetPositionDuringTick;                                   // 0x07E2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bOffsetByHMD;                                             // 0x07E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bAutoSetLockToHmd : 1;                                    // 0x07E4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x3];                                       // 0x07E5(0x0003) MISSED OFFSET
	struct FBPVRComponentPosRep                        ReplicatedCameraTransform;                                // 0x07E8(0x001C) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x1A];                                      // 0x0804(0x001A) MISSED OFFSET
	bool                                               bSmoothReplicatedMotion;                                  // 0x081E(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x081F(0x0001) MISSED OFFSET
	float                                              NetUpdateRate;                                            // 0x0820(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1C];                                      // 0x0824(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.ReplicatedVRCameraComponent");
		return ptr;
	}


	void Server_SendCameraTransform(const struct FBPVRComponentPosRep& NewTransform);
	void OnRep_ReplicatedCameraTransform();
};


// Class VRExpansionPlugin.VRAIController
// 0x0000 (0x0438 - 0x0438)
class AVRAIController : public AAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.VRAIController");
		return ptr;
	}

};


// Class VRExpansionPlugin.VRDetourCrowdAIController
// 0x0000 (0x0438 - 0x0438)
class AVRDetourCrowdAIController : public AVRAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.VRDetourCrowdAIController");
		return ptr;
	}

};


// Class VRExpansionPlugin.VRBaseCharacter
// 0x00C0 (0x0800 - 0x0740)
class AVRBaseCharacter : public ACharacter
{
public:
	struct FScriptMulticastDelegate                    OnPlayerStateReplicated_Bind;                             // 0x0740(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               VRReplicateCapsuleHeight;                                 // 0x0750(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0751(0x0003) MISSED OFFSET
	struct FVRReplicatedCapsuleHeight                  ReplicatedCapsuleHeight;                                  // 0x0754(0x0004) (Net)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0758(0x0008) MISSED OFFSET
	struct FTransform                                  OffsetComponentToWorld;                                   // 0x0760(0x0030) (BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData)
	struct FVRSeatedCharacterInfo                      SeatInformation;                                          // 0x0790(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      UnknownData02[0x4];                                       // 0x07B4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnSeatThreshholdChanged_Bind;                             // 0x07B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class USceneComponent*                             NetSmoother;                                              // 0x07C8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UVRBaseCharacterMovementComponent*           VRMovementReference;                                      // 0x07D0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData)
	class UReplicatedVRCameraComponent*                VRReplicatedCamera;                                       // 0x07D8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UParentRelativeAttachmentComponent*          ParentRelativeAttachment;                                 // 0x07E0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UGripMotionControllerComponent*              LeftMotionController;                                     // 0x07E8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UGripMotionControllerComponent*              RightMotionController;                                    // 0x07F0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UClass*                                      DefaultNavigationFilterClass;                             // 0x07F8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.VRBaseCharacter");
		return ptr;
	}


	void StopNavigationMovement();
	void SetCharacterSizeVR(float NewRadius, float NewHalfHeight, bool bUpdateOverlaps);
	void SetCharacterHalfHeightVR(float HalfHeight, bool bUpdateOverlaps);
	struct FVector SetActorRotationVR(const struct FRotator& NewRot, bool bUseYawOnly, bool bAccountForHMDRotation);
	struct FVector SetActorLocationAndRotationVR(const struct FVector& NewLoc, const struct FRotator& NewRot, bool bUseYawOnly, bool bAccountForHMDRotation);
	void Server_SetSeatedMode(class USceneComponent* SeatParent, bool bSetSeatedMode, const struct FVector_NetQuantize100& TargetLoc, float TargetYaw, float AllowedRadius, float AllowedRadiusThreshold, bool bZeroToHead);
	void Server_SendTransformRightController(const struct FBPVRComponentPosRep& NewTransform);
	void Server_SendTransformLeftController(const struct FBPVRComponentPosRep& NewTransform);
	void Server_SendTransformCamera(const struct FBPVRComponentPosRep& NewTransform);
	void Server_ReZeroSeating(const struct FVector_NetQuantize100& NewRelativeHeadLoc, float NewRelativeHeadYaw, bool bZeroToHead);
	void RegenerateOffsetComponentToWorld(bool bUpdateBounds, bool bCalculatePureYaw);
	void ReceiveNavigationMoveCompleted(TEnumAsByte<EPathFollowingResult> PathingResult);
	void OnSeatThreshholdChanged(bool bIsWithinThreshold, float ToThresholdScaler);
	void OnSeatedModeChanged(bool bNewSeatedMode, bool bWasAlreadySeated);
	void OnRep_SeatedCharInfo();
	void OnRep_CapsuleHeight();
	void OnEndWallPushback();
	void OnCustomMoveActionPerformed(EVRMoveAction MoveActionType, const struct FVector& MoveActionVector, const struct FRotator& MoveActionRotator);
	void OnClimbingSteppedUp();
	void OnBeginWallPushback(const struct FHitResult& HitResultOfImpact, bool bHadLocomotionInput, const struct FVector& HmdInput);
	void NotifyOfTeleport();
	bool HasPartialPath();
	struct FVector GetVRUpVector();
	struct FRotator GetVRRotation();
	struct FVector GetVRRightVector();
	struct FVector GetVRLocation();
	struct FVector GetVRForwardVector();
	struct FVector GetTeleportLocation(const struct FVector& OriginalLocation);
	TEnumAsByte<EPathFollowingStatus> GetMoveStatus();
	class USkeletalMeshComponent* GetIKMesh();
	void ExtendedSimpleMoveToLocation(const struct FVector& GoalLocation, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, class UClass* FilterClass, bool bAllowPartialPath);
	struct FVector AddActorWorldRotationVR(const struct FRotator& DeltaRot, bool bUseYawOnly);
};


// Class VRExpansionPlugin.VRBaseCharacterMovementComponent
// 0x0060 (0x07D0 - 0x0770)
class UVRBaseCharacterMovementComponent : public UCharacterMovementComponent
{
public:
	unsigned char                                      UnknownData00[0x37];                                      // 0x0770(0x0037) MISSED OFFSET
	bool                                               bIgnoreSimulatingComponentsInFloorCheck;                  // 0x07A7(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRunControlRotationInMovementComponent;                   // 0x07A8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x07A9(0x0003) MISSED OFFSET
	float                                              VRClimbingStepHeight;                                     // 0x07AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VRClimbingEdgeRejectDistance;                             // 0x07B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VRClimbingStepUpMultiplier;                               // 0x07B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SetDefaultPostClimbMovementOnStepUp;                      // 0x07B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x07B9(0x0003) MISSED OFFSET
	float                                              VRClimbingMaxReleaseVelocitySize;                         // 0x07BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VREdgeRejectDistance;                                     // 0x07C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EVRConjoinedMovementModes                          DefaultPostClimbMovement;                                 // 0x07C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x07C5(0x0003) MISSED OFFSET
	float                                              VRLowGravWallFrictionScaler;                              // 0x07C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               VRLowGravIgnoresDefaultFluidFriction;                     // 0x07CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x07CD(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.VRBaseCharacterMovementComponent");
		return ptr;
	}


	void SetReplicatedMovementMode(EVRConjoinedMovementModes NewMovementMode);
	void SetCrouchedHalfHeight(float NewCrouchedHalfHeight);
	void SetClimbingMode(bool bIsClimbing);
	struct FVector RewindVRMovement();
	void PerformMoveAction_Teleport(const struct FVector& TeleportLocation, const struct FRotator& TeleportRotation, bool bSkipEncroachmentCheck);
	void PerformMoveAction_StopAllMovement();
	void PerformMoveAction_SnapTurn(float SnapTurnDeltaYaw);
	void PerformMoveAction_SetRotation(float NewYaw);
	void PerformMoveAction_Custom(EVRMoveAction MoveActionToPerform, EVRMoveActionDataReq DataRequirementsForMoveAction, const struct FVector& MoveActionVector, const struct FRotator& MoveActionRotator);
	struct FVector GetCustomInputVector();
	void ClientVeryShortAdjustPosition(float Timestamp, const struct FVector& NewLoc, class UPrimitiveComponent* NewBase, const struct FName& NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode);
	void ClientAdjustPosition(float Timestamp, const struct FVector& NewLoc, const struct FVector& NewVel, class UPrimitiveComponent* NewBase, const struct FName& NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode);
	void AddCustomReplicatedMovement(const struct FVector& Movement);
};


// Class VRExpansionPlugin.VRButtonComponent
// 0x0090 (0x0680 - 0x05F0)
class UVRButtonComponent : public UStaticMeshComponent
{
public:
	struct FScriptMulticastDelegate                    OnButtonStateChanged;                                     // 0x05F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TWeakObjectPtr<class UPrimitiveComponent>          InteractingComponent;                                     // 0x0600(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bIsEnabled;                                               // 0x0608(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bButtonState;                                             // 0x0609(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x060A(0x0002) MISSED OFFSET
	float                                              DepressSpeed;                                             // 0x060C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DepressDistance;                                          // 0x0610(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EVRButtonType                                      ButtonType;                                               // 0x0614(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EVRInteractibleAxis                                ButtonAxis;                                               // 0x0615(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0616(0x0002) MISSED OFFSET
	float                                              ButtonEngageDepth;                                        // 0x0618(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinTimeBetweenEngaging;                                   // 0x061C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bSkipOverlapFiltering;                                    // 0x0620(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5F];                                      // 0x0621(0x005F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRExpansionPlugin.VRButtonComponent");
		return ptr;
	}


	void SetButtonToRestingPosition(bool bLerpToPosition);
	void SetButtonState(bool bNewButtonState, bool bCallButtonChangedEvent, bool bSnapIntoPosition);
	void ResetInitialButtonLocation();
	void ReceiveButtonStateChanged(bool bCurButtonState);
